app/controllers/pizzas_controller.rb

def index
pizza = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"