app/controllers/restaurant_pizzas_controller.rb

INSERT INTO "restaurantpizzas" ("price", "pizza_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 22], ["pizza_id", 3], ["restaurant_id", 2], ["created_at", "2023-03-19 07:10:45.404769"], ["updated_at", "2023-03-19 07:10:45.404769"]]
---
def create
restaurant_pizzas =Restaurantpizza.create(params.permit(:price, :pizza_id, :restaurant_id))